# 'brew tap'
tap "epk/epk"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/core"
tap "homebrew/services"
tap "koekeishiya/formulae"

# 'brew install'
brew "asdf"
brew "awscli"
brew "bat"
brew "btop"
brew "exa"
brew "ffmpeg"
brew "fzf"
brew "gh"
brew "jq"
brew "jsonschema"
brew "neovim"
brew "poetry"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"
brew "lunchy"

# 'brew install --cask'
cask "1password"
cask "alt-tab"
cask "aws-vault"
cask "docker"
cask "font-sf-mono-nerd-font"
cask "grammarly-desktop"
cask "iterm2"
cask "logitech-options"
cask "miro"
cask "obsidian"
cask "opera"
cask "stats"
cask "visual-studio-code"
cask "xbar"
cask "zoom"
cask "firefox"
