# 'brew tap'
tap "epk/epk"
tap "homebrew/bundle"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "homebrew/cask-versions"
tap "jorgelbg/tap"
tap "hashicorp/tap"
tap "FelixKratz/formulae"

# 'brew install'
brew "git"
brew "delta"
brew "asdf"
brew "awscli"
brew "aws-cdk"
brew "bat"
brew "btop"
brew "eza"
brew "ffmpeg"
brew "fzf"
brew "gh"
brew "glab"
brew "jq"
brew "make"
brew "jsonschema"
brew "neovim"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"
brew "borders"
brew "git-filter-repo"
brew "diceware"
brew "gpg"
brew "pinentry-mac"
brew "pre-commit"
brew "pinentry-touchid"
brew "aws-sam-cli"
brew "fish"
brew "starship"
brew "zoxide"
brew "ripgrep"
brew "pyright"
brew "pdm"
brew "direnv"
brew "rust"
brew "rust-analyzer"
brew "lazygit"
brew "ollama"
brew "speedtest-cli"
brew "duckdb"
brew "atuin"
brew "csvlens"
brew "ouch"
brew "yazi"

# 'brew install --cask'
cask "1password"
cask "1password-cli"
cask "alt-tab"
cask "aws-vault"
cask "session-manager-plugin"
cask "docker"
cask "font-jetbrains-mono-nerd-font"
cask "font-sf-mono-nerd-font"
cask "grammarly-desktop"
cask "logi-options-plus"
cask "obsidian"
cask "stats"
cask "visual-studio-code"
cask "whatsapp"
cask "sf-symbols"
cask "hiddenbar"
cask "font-lexend"
cask "iina"
cask "slack"
cask "spaceid"
cask "telegram"
cask "meetingbar"
cask "cloudflare-warp"
cask "alfred"
cask "raspberry-pi-imager"
cask "logitune"
cask "microsoft-teams"
cask "progressive-downloader"
cask "wezterm"
cask "firefox"
cask "zen-browser"
cask "ghostty"
