# 'brew tap'
tap "epk/epk"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/core"
tap "homebrew/services"
tap "homebrew/cask-fonts" 
tap "koekeishiya/formulae"
tap "homebrew/cask-versions"
tap "jorgelbg/tap"

# 'brew install'
brew "git"
brew "asdf"
brew "awscli"
brew "aws-cdk"
brew "aws-nuke"
brew "bat"
brew "btop"
brew "exa"
brew "ffmpeg"
brew "fzf"
brew "gh"
brew "jq"
brew "make"
brew "jsonschema"
brew "neovim"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"
brew "tectonic"
brew "pandoc"
brew "terraform"
brew "git-filter-repo"
brew "diceware"
brew "gpg"
brew "pinentry-mac"
brew "pre-commit"
brew "pinentry-touchid"
brew "pdm"
brew "aws-sam-cli"
brew "fish"
brew "starship"

# 'brew install --cask'
cask "1password"
cask "1password-cli"
cask "alt-tab"
cask "aws-vault"
cask "session-manager-plugin"
cask "docker"
cask "font-sf-mono-nerd-font"
cask "grammarly-desktop"
cask "iterm2"
cask "logi-options-plus"
cask "miro"
cask "obsidian"
cask "stats"
cask "visual-studio-code"
cask "visual-studio-code-insiders"
cask "whatsapp"
cask "sf-symbols"
cask "hiddenbar"
cask "font-lexend"
cask "espanso"
cask "iina"
cask "alfred"
cask "slack"
cask "spaceid"
cask "telegram"
cask "meetingbar"
cask "zoom"
cask "arc"
cask "cloudflare-warp"
cask "microsoft-edge"
cask "raycast"
cask "raspberry-pi-imager"
cask "logitune"
cask "obs"
cask "microsoft-teams"
